import matplotlib
from matplotlib import pyplot as plt
from matplotlib.font_manager import FontManager, FontProperties

# y = [37.1,38.2,5.16,27.54,29.31,51.33,41.91,-3.63,70.6,-20.29,10.17,-4.03,-4.43,-11.91,-37.9,-45.08,-64.31,-51.78,-28.65,-15.04,-1.53
#     ,14.1,23.56,20.57,26.95,45.21,47.98,50.37,13.43,10.43,10.15,-2.97,-5.04]
# x = [1986,1987,1988,1989,1990,1991,1992,1993,1994,1995,1996,1997,1998,1999,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
#     ,2011,2012,2013,2014,2015,2016,2017,2018]

x = [2019,2020,2021,2022,2023,2024,2025,2026,2027,2028,2029]
y = [7.227,-0.155,5.877,1.674,5.280,2.928,5.122,3.847,5.219,4.571,5.465]

def getChineseFont():
    return FontProperties(fname='/System/Library/Fonts/PingFang.ttc')

# 设置标题
plt.title("预测结果", fontproperties=getChineseFont())
plt.plot(x, y)
plt.show()

